Revit 2027 API
RebarBendData.CrankOffsetLength1 Property
Identifies the crank offset length at the end.
The default value is 0. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CrankOffsetLength1 { get; }
Public ReadOnly Property CrankOffsetLength1 As Double
	Get
public:
property double CrankOffsetLength1 {
	double get ();
}
member CrankOffsetLength1 : float with get
Property Value
Double
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace